espruino/Espruino/targets/stm32/jshardware.c
  if (FLASH_MAGIC != *(unsigned int*)FLASH_MAGIC_LOCATION) {
    jsiConsolePrint("\nFlash Magic Byte is wrong");
    errors++;
  }

  if (errors) {
      jsiConsolePrintf("\nThere were %d errors!\n>", errors);
  } else
      jsiConsolePrint("\nDone!\n>");

//  This is nicer, but also broken!
//  FLASH_UnlockBank1();
//  /* Clear All pending flags */
//  FLASH_ClearFlag(FLASH_FLAG_EOP | FLASH_FLAG_PGERR | FLASH_FLAG_WRPRTERR);
//
//  size_t varDataSize = jsvGetVarDataSize();
//  int *basePtr = jsvGetVarDataPointer();
//
//  int page;
//  for(page=0;page<FLASH_SAVED_CODE_PAGES;page++) {
//    jsPrint("Flashing Page ");jsPrintInt(page);jsPrint("...\n");
//    size_t pageOffset = (FLASH_PAGE_SIZE * page);
//    size_t pagePtr = FLASH_SAVED_CODE_START + pageOffset;
//    size_t pageSize = varDataSize-pageOffset;
//    if (pageSize>FLASH_PAGE_SIZE) pageSize = FLASH_PAGE_SIZE;
//    jsPrint("Offset ");jsPrintInt(pageOffset);jsPrint(", Size ");jsPrintInt(pageSize);jsPrint(" bytes\n");
//    bool first = true;
//    int errors = 0;
//    int i;
//    for (i=pageOffset;i<pageOffset+pageSize;i+=4)
//      if ((*(int*)(FLASH_SAVED_CODE_START+i)) != basePtr[i>>2])
//        errors++;
//    while (errors && !jspIsInterrupted()) {
//      if (!first) { jsPrintInt(errors);jsPrint(" errors - retrying...\n"); }
//      first = false;
//      /* Erase the FLASH page */
//      FLASH_ErasePage(pagePtr);
//      /* Program Flash Bank1 */
//      for (i=pageOffset;i<pageOffset+pageSize;i+=4)
//          FLASH_ProgramWord(FLASH_SAVED_CODE_START+i, basePtr[i>>2]);
//      FLASH_WaitForLastOperation(0x20000);
//    }
//  }
//  // finally flash magic byte
//  FLASH_ProgramWord(FLASH_MAGIC_LOCATION, FLASH_MAGIC);
//  FLASH_WaitForLastOperation(0x20000);
//  FLASH_LockBank1();
//  if (*(int*)FLASH_MAGIC_LOCATION != FLASH_MAGIC)
//    jsPrint("Flash magic word not flashed correctly!\n");
//  jsPrint("Flashing Complete\n");

}

void jshLoadFromFlash() {
  unsigned int dataSize = jsvGetMemoryTotal() * sizeof(JsVar);
  jsiConsolePrintf("\nLoading %d  bytes from flash...", dataSize);

  JsVar *firstData = jsvLock(1);
  uint32_t *basePtr = (uint32_t *)firstData;
  jsvUnLock(firstData);

  memcpy(basePtr, (int*)FLASH_SAVED_CODE_START, dataSize);
  jsiConsolePrint(" Done!\n>");
}

bool jshFlashContainsCode() {
  /*jsPrint("Magic contains ");
  jsPrintInt(*(int*)FLASH_MAGIC_LOCATION);
  jsPrint("we want");
  jsPrintInt(FLASH_MAGIC);
  jsPrint("\n");*/
  return (*(int*)FLASH_MAGIC_LOCATION) == (int)FLASH_MAGIC;
}

extern void SetSysClock(void);

/// Enter simple sleep mode (can be woken up by interrupts). Returns true on success
bool jshSleep(JsSysTime timeUntilWake) {

/*#ifdef ESPRUINOBOARD
  // This code gets power consumption down to 6.5mA on idle - from 15mA
  while(USART_GetFlagStatus(USART1, USART_FLAG_TC) == RESET) { } // HACK - wait for USART1
  // Switch to HSI
  RCC_HSICmd(ENABLE);
  while(RCC_GetFlagStatus(RCC_FLAG_HSIRDY) == RESET);   
  RCC_SYSCLKConfig(RCC_SYSCLKSource_HSI); 
  while(RCC_GetSYSCLKSource() !=  0x00);
  RCC_PLLCmd ( DISABLE ) ;
  RCC_HSEConfig(RCC_HSE_OFF);
  // set peripherals for new clock rates
  SystemCoreClockUpdate();
  JshUSARTInfo inf;
  jshUSARTInitInfo(&inf);
  jshUSARTSetup(DEFAULT_CONSOLE_DEVICE, &inf);
#endif*/

#ifdef ESPRUINOBOARD
  /* TODO:
       Check jsiGetConsoleDevice to make sure we don't have to wake on USART (we can't do this fast enough)
       Check that we're not using EXTI 11 for something else
       Check we're not using PWM/Utility timer as these will stop
       What about EXTI line 18 - USB Wakeup event
   */
  if (allowDeepSleep &&  // from setDeepSleep
      (timeUntilWake > (JSSYSTIME_RTC*3/2)) &&  // if there's less time that this then we can't go to sleep because we can't wake
      !jshHasTransmitData() && // if we're transmitting, we don't want USART/etc to get slowed down
      jshLastWokenByUSB+jshGetTimeFromMilliseconds(1000)<jshGetSystemTime() && // if woken by USB, stay awake long enough for the PC to make a connection
      true
      ) {
    jsiSetSleep(true);
    // deep sleep!
    jshADCInitialised = 0;
    ADC_Cmd(ADC1, DISABLE); // ADC off
    ADC_Cmd(ADC2, DISABLE); // ADC off
    ADC_Cmd(ADC3, DISABLE); // ADC off
#if ADCS>3
    ADC_Cmd(ADC4, DISABLE); // ADC off
#endif
#ifdef USB
 //   PowerOff(); // USB disconnect - brings us down to 0.12mA - but seems to lock Espruino up afterwards!
    USB_Cable_Config(DISABLE);
    _SetCNTR(_GetCNTR() | CNTR_PDWN);
#endif

    /* Add EXTI for Serial port */
    //jshPinWatch(JSH_PORTA_OFFSET+10, true);
    /* add exti for USB */
#ifdef USB
    // USB has 15k pull-down resistors (and STM32 has 40k pull up)
    Pin usbPin = JSH_PORTA_OFFSET+11;
    jshPinSetState(usbPin, JSHPINSTATE_GPIO_IN_PULLUP);
    Pin oldWatch = watchedPins[pinInfo[usbPin].pin];
    jshPinWatch(usbPin, true);
#endif
    if (timeUntilWake!=JSSYSTIME_MAX) { // set alarm
      RTC_SetAlarm(RTC_GetCounter() + (unsigned int)((timeUntilWake-(timeUntilWake/2))/JSSYSTIME_RTC)); // ensure we round down and leave a little time
      RTC_ITConfig(RTC_IT_ALR, ENABLE);
      //RTC_AlarmCmd(RTC_Alarm_A, ENABLE);
      RTC_WaitForLastTask();
    }
    // set flag in case there happens to be a SysTick
    hasSystemSlept = true;
    // -----------------------------------------------
    /* Request to enter STOP mode with regulator in low power mode*/
    PWR_EnterSTOPMode(PWR_Regulator_LowPower, PWR_STOPEntry_WFI);
    // -----------------------------------------------
    if (timeUntilWake!=JSSYSTIME_MAX) { // disable alarm
      RTC_ITConfig(RTC_IT_ALR, DISABLE);
      //RTC_AlarmCmd(RTC_Alarm_A, DISABLE);
    }
#ifdef USB
    bool wokenByUSB = jshPinGetValue(usbPin)==0;
    // remove watches on pins
    jshPinWatch(usbPin, false);
    if (oldWatch!=PIN_UNDEFINED) jshPinWatch(oldWatch, true);
    jshPinSetState(usbPin, JSHPINSTATE_GPIO_IN);
#endif
    // recover oscillator
    RCC_HSEConfig(RCC_HSE_ON);
    if( RCC_WaitForHSEStartUp() == SUCCESS) {
      RCC_PLLCmd(ENABLE);
      while(RCC_GetFlagStatus(RCC_FLAG_PLLRDY) == RESET);
      RCC_SYSCLKConfig(RCC_SYSCLKSource_PLLCLK);
      while(RCC_GetSYSCLKSource() != 0x08);
    }
    RTC_WaitForSynchro(); // make sure any RTC reads will be
#ifdef USB
    _SetCNTR(_GetCNTR() & ~CNTR_PDWN);
    USB_Cable_Config(ENABLE);
  //  PowerOn(); // USB on
    if (wokenByUSB)
      jshLastWokenByUSB = jshGetSystemTime();
#endif
    jsiSetSleep(false);
  } else
#endif
#ifdef USE_RTC
  if (timeUntilWake > averageSysTickTime*5/4) {
#else
  if (timeUntilWake > SYSTICK_RANGE*5/4) {
#endif
    // TODO: we can do better than this. look at lastSysTickTime
    jsiSetSleep(true);
    __WFI(); // Wait for Interrupt
    jsiSetSleep(false);
    return true;
  }

