espruino/Espruino/targets/stm32/jshardware.c
  return false;

/*#ifdef ESPRUINOBOARD
  // recover...
  RCC_HSEConfig ( RCC_HSE_ON ) ;
  while(RCC_GetFlagStatus(RCC_FLAG_HSERDY) == RESET);
  RCC_PLLCmd ( ENABLE ) ;
  while ( RCC_GetFlagStatus ( RCC_FLAG_PLLRDY ) == RESET ) ;
  RCC_SYSCLKConfig(RCC_SYSCLKSource_PLLCLK);
  while(RCC_GetSYSCLKSource() != 0x08);
  RCC_HSICmd(DISABLE);
  // re-initialise peripherals
  SystemCoreClockUpdate();
  jshUSARTInitInfo(&inf);
  jshUSARTSetup(DEFAULT_CONSOLE_DEVICE, &inf);
#endif*/
}

typedef enum {
  UT_NONE,
  UT_PULSE_ON,
  UT_PULSE_OFF,
  UT_PIN_SET_RELOAD_EVENT,
  UT_PIN_SET,
} PACKED_FLAGS UtilTimerType;

#define UTILTIMERTASK_PIN_COUNT (4)
typedef struct UtilTimerTask {
  JsSysTime time; // time at which to set pins
  Pin pins[UTILTIMERTASK_PIN_COUNT]; // pins to set
  uint8_t value; // value to set pins to
} PACKED_FLAGS UtilTimerTask;

#define UTILTIMERTASK_TASKS (16) // MUST BE POWER OF 2
UtilTimerTask utilTimerTasks[UTILTIMERTASK_TASKS];
volatile unsigned char utilTimerTasksHead = 0;
volatile unsigned char utilTimerTasksTail = 0;


volatile UtilTimerType utilTimerType = UT_NONE;
unsigned int utilTimerBit;
bool utilTimerState;
unsigned int utilTimerData;
uint16_t utilTimerReload0H, utilTimerReload0L, utilTimerReload1H, utilTimerReload1L;
Pin utilTimerPin;

void _utilTimerDisable() {
  utilTimerType = UT_NONE;
  TIM_Cmd(UTIL_TIMER, DISABLE);
}

void _utilTimerEnable(uint16_t prescale, uint16_t initialPeriod) {
  if (utilTimerType != UT_PIN_SET) {
    jshSetPinStateIsManual(utilTimerPin, false);
    jshPinSetState(utilTimerPin, JSHPINSTATE_GPIO_OUT);
  }

  /* TIM6 Periph clock enable */
  RCC_APB1PeriphClockCmd(UTIL_TIMER_APB1, ENABLE);


  /*Timer configuration------------------------------------------------*/
  TIM_ITConfig(UTIL_TIMER, TIM_IT_Update, DISABLE);
  TIM_Cmd(UTIL_TIMER, DISABLE);
 // TIM_ARRPreloadConfig(UTIL_TIMER, FALSE); // disable auto buffering 'period' register
// TIM_UpdateRequestConfig(UTIL_TIMER, TIM_UpdateSource_Regular); // JUST underflow/overflow

  TIM_TimeBaseInitTypeDef TIM_TimeBaseInitStruct;
  TIM_TimeBaseStructInit(&TIM_TimeBaseInitStruct);
  TIM_TimeBaseInitStruct.TIM_Prescaler = prescale;
  TIM_TimeBaseInitStruct.TIM_Period = initialPeriod;
  TIM_TimeBaseInit(UTIL_TIMER, &TIM_TimeBaseInitStruct);

  //TIM_ClearITPendingBit(UTIL_TIMER, TIM_IT_Update);
  TIM_ITConfig(UTIL_TIMER, TIM_IT_Update, ENABLE);
  TIM_Cmd(UTIL_TIMER, ENABLE);  /* enable counter */
}

void _utilTimerSetPinStateAndReload() {
  if (utilTimerType == UT_PIN_SET_RELOAD_EVENT) {
    // in order to set this timer, we must have set the arr register, fired the timer irq, and then waited for the next!
    utilTimerType = UT_PIN_SET;
  } else if (utilTimerType == UT_PULSE_ON) {
    utilTimerType = UT_PULSE_OFF;
    jshPinSetValue(utilTimerPin, utilTimerState);
  } else if (utilTimerType == UT_PULSE_OFF) {
    jshPinSetValue(utilTimerPin, !utilTimerState);
     _utilTimerDisable();
  /*} else if (utilTimerType == UT_PIN_SET_INITIAL_HACK) {
    utilTimerType = UT_PIN_SET;*/
  } else if (utilTimerType == UT_PIN_SET) {
    //jshPinSetValue(LED4_PININDEX,1);
    JsSysTime time = jshGetSystemTime();
    // execute any timers that are due
    while (utilTimerTasksTail!=utilTimerTasksHead && utilTimerTasks[utilTimerTasksTail].time<time) {
      UtilTimerTask *task = &utilTimerTasks[utilTimerTasksTail];
      int j;
      for (j=0;j<UTILTIMERTASK_PIN_COUNT;j++) {
        if (task->pins[j] == PIN_UNDEFINED) break;
        jshPinSetValue(task->pins[j], (task->value >> j)&1);
      }          
      utilTimerTasksTail = (utilTimerTasksTail+1) & (UTILTIMERTASK_TASKS-1);
    }

    // re-schedule the timer if there is something left to do
    if (utilTimerTasksTail != utilTimerTasksHead) {
      utilTimerType = UT_PIN_SET_RELOAD_EVENT;
      unsigned int timerFreq = jshGetTimerFreq(UTIL_TIMER);
      int clockTicks = (int)(((JsVarFloat)timerFreq * (JsVarFloat)(utilTimerTasks[utilTimerTasksTail].time-time)) / getSystemTimerFreq());
      if (clockTicks<0) clockTicks=0;
      int prescale = clockTicks/65536; // ensure that maxTime isn't greater than the timer can count to
      if (prescale>65535) prescale=65535;
      int ticks = (uint16_t)(clockTicks/(prescale+1));
      if (ticks<1) ticks=1;
      if (ticks>65535) ticks=65535;
      TIM_TimeBaseInitTypeDef TIM_TimeBaseInitStruct;
      TIM_TimeBaseStructInit(&TIM_TimeBaseInitStruct);
      TIM_TimeBaseInitStruct.TIM_Prescaler = (uint16_t)prescale;
      TIM_TimeBaseInitStruct.TIM_Period = (uint16_t)ticks;
      TIM_TimeBaseInit(UTIL_TIMER, &TIM_TimeBaseInitStruct);
    } else {
      _utilTimerDisable();
    }
    //jshPinSetValue(LED4_PININDEX,0);
  } else {
    // What the??
    _utilTimerDisable();
  }

}

/// Called when the timer is fired
void UTIL_TIMER_IRQHandler(void) {
  // clear interrupt flag
  if (TIM_GetITStatus(UTIL_TIMER, TIM_IT_Update) != RESET) {
    TIM_ClearITPendingBit(UTIL_TIMER, TIM_IT_Update);
    // handle
    _utilTimerSetPinStateAndReload();
  }
}

void _utilTimerWait() {
  WAIT_UNTIL(utilTimerType == UT_NONE, "Utility Timer");
}

void jshPinPulse(Pin pin, bool pulsePolarity, JsVarFloat pulseTime) {
  // ---- SOFTWARE PULSE
  /* JsSysTime ticks = jshGetTimeFromMilliseconds(time);
 //jsPrintInt(ticks);jsPrint("\n");
  if (jshIsPinValid(pin) {
    jshPinSetState(pin, JSHPINSTATE_GPIO_OUT);
    jshPinSetValue(pin, value);
    JsSysTime starttime = jshGetSystemTime();
    JsSysTime endtime = starttime + ticks;
    //jsPrint("----------- ");jsPrintInt(endtime>>16);jsPrint("\n");
    JsSysTime stime = jshGetSystemTime();
    while (stime>=starttime && stime<endtime && !jspIsInterrupted()) { // this stops rollover issue
      stime = jshGetSystemTime();
      //jsPrintInt(stime>>16);jsPrint("\n");
    }
    jshPinSetValue(pin, !value);
  } else jsError("Invalid pin!"); */
  // ---- USE TIMER FOR PULSE
  if (!jshIsPinValid(pin)) {
       jsError("Invalid pin!");
       return;
  }
  _utilTimerWait();

  unsigned int timerFreq = jshGetTimerFreq(UTIL_TIMER);
  int clockTicks = (int)(((JsVarFloat)timerFreq * pulseTime) / 1000);
  int prescale = clockTicks/65536; // ensure that maxTime isn't greater than the timer can count to

  uint16_t ticks = (uint16_t)(clockTicks/(prescale+1));

  /*jsiConsolePrintInt(SystemCoreClock);jsiConsolePrint(",");
  jsiConsolePrintInt(ticks);jsiConsolePrint(",");
  jsiConsolePrintInt(prescale);jsiConsolePrint("\n");*/

  utilTimerType = UT_PULSE_ON;
  utilTimerState = pulsePolarity;
  utilTimerPin = pin;


  _utilTimerEnable((uint16_t)prescale, ticks);
}

