espruino/Espruino/targets/stm32/jshardware.c
bool jshPinOutputAtTime(JsSysTime time, Pin pin, bool value) {
  unsigned char nextHead = (utilTimerTasksHead+1) & (UTILTIMERTASK_TASKS-1);
  if (nextHead == utilTimerTasksTail) { 
/*    JsSysTime t = jshGetSystemTime();
    jsiConsolePrint("Timer Queue full\n");
    while (nextHead!=utilTimerTasksHead) {
      jsiConsolePrint("Task ");
      jsiConsolePrintInt(utilTimerTasks[nextHead].value);
      jsiConsolePrint(" at ");
      char buf[32];
      ftoa_bounded(jshGetMillisecondsFromTime(utilTimerTasks[nextHead].time-t)/1000, buf, sizeof(buf));
      jsiConsolePrint(buf);
      jsiConsolePrint("s\n");
      nextHead = (nextHead+1) & (UTILTIMERTASK_TASKS-1);
    }*/

    return false;
  }

  jshInterruptOff();  
  int insertPos = utilTimerTasksTail;
  // find out where to insert
  while (insertPos != utilTimerTasksHead && utilTimerTasks[insertPos].time < time)
    insertPos = (insertPos+1) & (UTILTIMERTASK_TASKS-1);

  if (utilTimerTasks[insertPos].time==time && utilTimerTasks[insertPos].pins[UTILTIMERTASK_PIN_COUNT-1]==PIN_UNDEFINED) {
    // TODO: can we modify the call to jshPinOutputAtTime to do this without the seek with interrupts disabled?
    // if the time is correct, and there is a free pin...
    int i;
    for (i=0;i<UTILTIMERTASK_PIN_COUNT;i++)
      if (utilTimerTasks[insertPos].pins[i]==PIN_UNDEFINED) {
        utilTimerTasks[insertPos].pins[i] = pin;
        if (value) 
          utilTimerTasks[insertPos].value = utilTimerTasks[insertPos].value | (uint8_t)(1 << i);
        else
          utilTimerTasks[insertPos].value = utilTimerTasks[insertPos].value & (uint8_t)~(1 << i);
        break; // all done
      }
  } else {
    bool haveChangedTimer = insertPos==utilTimerTasksTail;
    //jsiConsolePrint("Insert at ");jsiConsolePrintInt(insertPos);jsiConsolePrint(", Tail is ");jsiConsolePrintInt(utilTimerTasksTail);jsiConsolePrint("\n");
    // shift items forward
    int i = utilTimerTasksHead;
    while (i != insertPos) {
      unsigned char next = (i+UTILTIMERTASK_TASKS-1) & (UTILTIMERTASK_TASKS-1);
      utilTimerTasks[i] = utilTimerTasks[next];
      i = next;
    }
    // add new item
    utilTimerTasks[insertPos].time = time;
    //jsiConsolePrint("Time is ");jsiConsolePrintInt(utilTimerTasks[insertPos].time);jsiConsolePrint("\n");
    utilTimerTasks[insertPos].pins[0] = pin;
    for (i=1;i<UTILTIMERTASK_PIN_COUNT;i++)
      utilTimerTasks[insertPos].pins[i] = PIN_UNDEFINED;
    utilTimerTasks[insertPos].value = value?0xFF:0;
    utilTimerTasksHead = (utilTimerTasksHead+1) & (UTILTIMERTASK_TASKS-1);
    //jsiConsolePrint("Head is ");jsiConsolePrintInt(utilTimerTasksHead);jsiConsolePrint("\n");
    // now set up timer if not already set up...
    if (utilTimerType != UT_PIN_SET || haveChangedTimer) {
      //jsiConsolePrint("Starting\n");
      unsigned int timerFreq = jshGetTimerFreq(UTIL_TIMER);
      int clockTicks = (int)(((JsVarFloat)timerFreq * (JsVarFloat)(utilTimerTasks[utilTimerTasksTail].time-jshGetSystemTime())) / getSystemTimerFreq());
      if (clockTicks<0) clockTicks=0;
      int prescale = clockTicks/65536; // ensure that maxTime isn't greater than the timer can count to
      int ticks = (uint16_t)(clockTicks/(prescale+1));
      if (ticks<1) ticks=1;
      if (ticks>65535) ticks=65535;
      utilTimerType = UT_PIN_SET_RELOAD_EVENT;
      _utilTimerEnable((uint16_t)prescale, (uint16_t)ticks);
      //jsiConsolePrintInt(utilTimerType);jsiConsolePrint("\n");
    }
  }
  jshInterruptOn();
  return true;
}

// timer enabled  p *(unsigned int *)0x40001400
// timer period  p *(unsigned int *)0x4000142C
